"%@ (optional)" = "%@ (mhux obbligatorja)";

"Account number" = "In-numru tal-kont";

"Address" = "Indirizz";

"Address line 1" = "Indirizz linja 1";

"Address line 2" = "It-tieni linja tal-indirizz";

"Area" = "Żona";

"BLIK code" = "Kodiċi BLIK";

"BSB number" = "Numru BSB";

"Bank account •••• %@" = "Kont tal-bank •••• %@";

"Billing address is same as shipping" = "L-indirizz tal-fatturazzjoni huwa l-istess bħall-indirizz tal-posta";

"Cancel" = "Ikkanċella";

"Card brand" = "Id-ditta tal-karta";

"City" = "Belt";

"Code field" = "Taqsima tal-kodiċi";

"Company" = "Kumpanija";

"Continue" = "Kompli";

"Country" = "Pajjiż";

"Country or region" = "Pajjiż jew reġjun";

"County" = "Kontea";

"Date is empty." = "Id-data hija battala.";

"Department" = "Dipartiment";

"District" = "Distrett";

"Do Si" = "Do Si";

"Do you want to close this form?" = "Trid tagħlaq din il-formola?";

"Done" = "Bil-lest";

"Double tap to edit" = "Taptap biex tibdel";

"Edit" = "Editja";

"Eircode" = "Eircode";

"Email" = "Email";

"Emirate" = "Emirat";

"Error" = "Żball";

"First" = "Ismek";

"Full name" = "Isem sħiħ";

"Incomplete phone number" = "In-numru tat-telefon mhuwiex komplut";

"Invalid UPI ID" = "L-ID UPI mhix tajba";

"Island" = "Gżira";

"Last" = "L-aħħar";

"Name" = "Isem";

"Name on account" = "Isem sid il-kont";

"OK" = "Tajjeb";

"Oblast" = "Oblast";

"Other" = "Oħrajn";

"Parish" = "Parroċċa";

"Phone number" = "In-numru tal-mowbajl";

"Postal code" = "Kodiċi postali";

"Prefecture" = "Prefettura";

"Province" = "Provinċja";

"Remove" = "Neħħi";

"Remove bank account?" = "Tixtieq tneħħi l-kont tal-bank?";

"Remove card" = "Neħħi l-karta";

"Search" = "Fittex";

"Select card brand (optional)" = "Agħżel id-ditta tal-karta (mhux obbligatorja)";

"Sort code" = "Il-kodiċi Sort";

"State" = "Stat";

"Suburb" = "Subborg";

"Suburb or city" = "Subborg jew belt";

"The BSB you entered is incomplete." = "Il-BSB li daħħalt mhux komplut.";

"The ID number you entered is incomplete." = "In-numru tal-ID li daħħalt mhuwiex komplut.";

"The account number you entered is incomplete." = "In-numru tal-kont li daħħalt mhux komplut.";

"The sort code you entered is invalid." = "Il-kodiċi sort li daħħalt mhux tajjeb.";

"Town or city" = "Belt";

"UPI ID" = "ID UPI";

"Unable to parse phone number" = "Ma jistax jaqra n-numru tat-telefown";

"Use rotor to access links" = "Uża r-rotor biex tiftaħ il-ħoloq";

"Your BLIK code is incomplete." = "Il-kodiċi BLIK li ktibt mhux komplut.";

"Your BLIK code is invalid." = "Il-kodiċi BLIK li ktibt mhux tajjeb.";

"Your ZIP is incomplete." = "Il-kodiċi postali tiegħek mhux komplut.";

"Your email is invalid." = "L-indirizz tal-email li daħħalt mhux tajjeb.";

"Your payment information will not be saved." = "L-informazzjoni tal-pagament tiegħek mhux se tiġi merfugħa.";

"Your postal code is incomplete." = "Il-kodiċi postali tiegħek mhux komplut.";

"ZIP" = "Kodiċi Postali";
